package HTML;

public class Q1 {
    //1.colspan 2.colgroup 3.preload 4.details 5.usemap
    //문제 1-1 :위의 5개의 태그가 요소인지, 속성인지 표현하고 각각 사용용도를 설명하시오.
    //답 : 1. 속성 2. 요소 3. 속성 4. 요소 5. 속성
    //1. colspan : 테이블의 열을 병합할 때 사용하는 속성
    //2. colgroup : 테이블의 열을 그룹화할 때 사용하는 요소
    //3. preload : 비디오나 오디오를 로딩방식을 지정할 때 사용하는 속성
    //4. details : 부가정보를 표시할 때 사용하는 요소
    //5. usemap : 이미지에 영역별 링크를 걸 때 사용하는 속성이며 링크를 걸 이미지에 map을 지정해야 한다, map은 <map> 요소를 사용해 지정

    //문제 1-2 : 순서없는 리스트와 순서있는 리스트를 비교 설명하시오.
    //답 : 순서없는 리스트는 <ul> 태그를 사용하고 순서있는 리스트는 <ol> 태그를 사용한다.
    //둘다 <li> 태그를 사용해 리스트를 만들 수 있다.
    //<ul> 태그는 글머리기호로 리스트의 항목을 표시한다.
    //list-style-type 속성을 사용해 글머리기호를 변경할 수 있다.
    //<ol> 태그는 숫자로 리스트의 항목을 표시한다.
    //type 속성을 사용해 숫자의 형태를 변경할 수 있다.
    //start 속성을 사용해 시작 숫자를 변경할 수 있다.
    //reversed 속성을 사용해 숫자의 순서를 역순으로 할 수 있다.
    //value 속성을 사용해 리스트의 항목을 지정할 수 있다.
}
